![title](./pic/indexing/index_based/1_title.png)

In [3]:
import pandas as pd

In [4]:
df = pd.read_csv('./csv/titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

`DataFrame.head()` zeigt dir immer die ersten 5 Einträge deines `DataFrames` an. Somit kannst du leicht den Überblick behalten. Das Pendant dazu ist `.tail()` was dir immer die letzten 5 Einträge zurückgibt. Du kannst den Methoden auch Zahlen übergeben z.B. `df.head(10)`, dann werden dir die ersten 10 Einträge angezeigt.

---

## Indexing in pandas

Der Indizierungsoperator und die Attributauswahl sind gut, weil sie genau so funktionieren wie im übrigen Python-Ökosystem. Als Anfänger kann man sie daher leicht erlernen und verwenden. Allerdings hat `Pandas` seine eigenen Zugriffsoperatoren, `loc` und `iloc`. Für fortgeschrittene Operationen solltest du diese verwenden.

### Index-based selection¶

Die Indizierung in Pandas funktioniert nach einem von zwei Paradigmen. Das erste ist die **indexbasierte Auswahl**: die Auswahl von Daten basierend auf ihrer numerischen Position in den Daten. `iloc` folgt diesem Paradigma.

Um die erste Datenzeile in einem DataFrame auszuwählen, können wir folgendes verwenden:

![title](./pic/indexing/index_based/2_iloc.png)

<video width="1000" controls src="./pic/indexing/index_based/3_iloc_example.mp4" />

Willst du dir den ersten Passagier deines `DataFrames` genauer ansehen, kannst du mit der `.iloc` und der Zeile `0` auf diesen zugreifen

In [4]:
df.iloc[0]

PassengerId                 892
Survived                      0
Pclass                        3
Name           Kelly, Mr. James
Sex                        male
Age                        34.5
SibSp                         0
Parch                         0
Ticket                   330911
Fare                     7.8292
Cabin                       NaN
Embarked                      Q
Name: 0, dtype: object

<br>

Sowohl `loc` als auch `iloc` arbeiten nach dem Prinzip **"row-first, column-second"**. Dies ist das Gegenteil von dem, was wir in nativem Python tun, nämlich **"column-first, row-second"**.

Das bedeutet, dass es geringfügig einfacher ist, Zeilen abzurufen, und geringfügig schwieriger, Spalten abzurufen. Um eine Spalte mit `.iloc` zu erhalten, können wir folgendes tun:

In [5]:
df.iloc[:, 0]

0       892
1       893
2       894
3       895
4       896
       ...
413    1305
414    1306
415    1307
416    1308
417    1309
Name: PassengerId, Length: 418, dtype: int64

<br>

Der Operator `:,` der ebenfalls aus Python stammt, bedeutet für sich genommen "alles". In Kombination mit anderen Selektoren kann er jedoch verwendet werden, um eine Reihe von Werten anzugeben. Um zum Beispiel die **PassengerId** nur aus der ersten, zweiten und dritten Zeile auszuwählen, würden wir Folgendes tun:

In [6]:
df.iloc[:3, 0]

0    892
1    893
2    894
Name: PassengerId, dtype: int64

<br>

Oder wir selektieren nur den **zweiten und dritten** Eintrag, wie folgt:

In [8]:
df.iloc[1:3, 0]

1    893
2    894
Name: PassengerId, dtype: int64

<br>

Es ist auch möglich, eine **Liste** zu übergeben:

In [9]:
df.iloc[[0, 1, 2], 0]

0    892
1    893
2    894
Name: PassengerId, dtype: int64

<br>

Schließlich ist es wichtig zu wissen, dass bei der Auswahl auch negative Zahlen verwendet werden können. Dabei wird vom Ende des `DataFrames` an vorwärts gezählt. Hier sind also zum Beispiel die letzten fünf Elemente des Datensatzes.

In [10]:
df.iloc[-5:]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C